[
    {
        "title": "面向开集识别的稳健测试时适应方法",
        "authors": [
            "周植，张丁楚，李宇峰，张敏灵"
        ],
        "summary": "开集识别旨在研究测试阶段突现未见类别对于机器学习模型的挑战,以期学习模型既能分类已见类别又可识别/拒绝未见类别,是确保机器学习模型能够在开放世界中高效稳健部署的重要技术.既有开集识别技术通常假设已见类别的协变量分布在训练与测试阶段维持不变.然而在实际场景中,类别的协变量分布常不断变化.直接利用既有技术不再奏效,其性能甚至劣于基线方案.因此,亟需研究新型开集识别方法,使其能不断适应协变量分布偏移,以期模型在测试阶段既能稳健分类已见类别又可识别未见类别.我们将此新问题设置命名为开放世界适应问题(简称AOW)并提出了一种开放测试时适应方法(简称OTA).本文方法基于无标注测试数据优化自适应熵损失与开集熵损失更新模型,维持对已见类的既有判别能力,同时增强了识别未见类的能力.大量实验分析表明,本文方法在多组基准数据集、多组不同协变量偏移程度下均稳健地优于现有先进的开集识别方法.",
        "pdf_url": "jos/article/pdf/7009?st=article_issue",
        "html_url": "jos/article/html/7009?st=article_issue"
    },
    {
        "title": "局部一致性主动学习的源域无关开集域自适应",
        "authors": [
            "王帆，韩忠义，苏皖，尹义龙"
        ],
        "summary": "无监督域自适应在解决训练集（源域）和测试集（目标域）分布不一致的问题上已经取得了一定的成功.在面向低能耗场景和开放动态任务环境时，在资源约束和开放类别出现的情况下，现有的无监督域自适应方法面临着严峻的挑战．源域无关开集域自适应(SF-ODA）旨在将源域模型中的知识迁移到开放类出现的无标签目标域，从而在无源域数据资源的限制下辨别公共类和检测开放类．现有的源域无关开集域自适应的方法聚焦于设计准确检测开放类别的源域模型或增改模型的结构．但是，这些方法不仅需要额外的存储空间和训练开销，而且在严格的隐私保护场景下难以实现．本文提出了一个更加实际的场景：主动学习的源域无关开集域自适应（ASF-ODA），目标是基于一个普通训练的源域模型和少量专家标注的有价值的目标域样本来实现鲁棒的迁移．为了达成此目标，本文提出了局部一致性主动学习（LCAL）算法．首先，利用目标域中局部特征标签一致的特点，LCAL设计了一种新的主动选择方法：局部多样性选择，来挑选更有价值的阈值模糊样本来促进开放类和公共类分离．接着，LCAL基于信息熵初步筛选出潜在的公共类集合和开放类集合，并利用第一步得到的主动标注样本对这两个集合进行匹配纠正，得到两个对应的可信集合．最后，LCAL引入开集损失和信息最大化损失来进一步促使公共类和开放类分离，引入交叉熵损失来实现公共类的辨别．在Office-31，Office-Home和VisDA-C三个公开的基准数据集上的大量实验表明，在少量有价值的目标域样本的帮助下，LCAL不仅显著优于现有的源域无关开集域自适应方法，还大幅度超过了现有的主动学习方法的表现，在某些迁移任务上可以提升20%．",
        "pdf_url": "jos/article/pdf/7010?st=article_issue",
        "html_url": "jos/article/html/7010?st=article_issue"
    },
    {
        "title": "元强化学习研究综述",
        "authors": [
            "陈奕宇，霍静，丁天雨，高阳"
        ],
        "summary": "近年来,深度强化学习(deep reinforcement learning,DRL)已经在诸多序贯决策任务中取得瞩目成功,但当前深度强化学习的成功很大程度依赖于海量的学习数据与计算资源,低劣的样本效率和策略通用性是制约其进一步发展的关键因素.元强化学习(meta-reinforcement learning,Meta-RL)致力于以更小的样本量适应更广泛的任务,其研究有望缓解上述限制从而推进强化学习领域发展.本文以元强化学习工作的研究对象与适用场景为脉络,对元强化学习领域的研究进展进行了全面梳理:首先对深度强化学习、元学习背景作基本介绍,然后对元强化学习作形式化定义及常见的场景设置总结,并从元强化学习研究成果的适用范围角度展开介绍元强化学习的现有研究进展,最后分析了元强化学习领域的研究挑战与发展前景.",
        "pdf_url": "jos/article/pdf/7011?st=article_issue",
        "html_url": "jos/article/html/7011?st=article_issue"
    },
    {
        "title": "神经网络结构搜索在脑数据分析领域的研究进展",
        "authors": [
            "李晴，汪启昕，李子遇，祝志远，张诗皓，牟浩南，杨文婷，邬霞"
        ],
        "summary": "神经网络结构搜索(neural architecture search,NAS)是自动化机器学习的重要组成部分,已被广泛应用于多个领域,包括计算机视觉、语音识别等,能够针对特定数据、场景、任务寻找最优的深层神经网络结构.将NAS引入至脑数据分析领域,能够在图像分割、特征提取、辅助诊断等多个应用领域大幅度提升性能,展现低能耗自动化机器学习的优势.基于NAS进行脑数据分析是当前的研究热点之一,同时也具有一定挑战.目前,在此领域,国内外可供参考的综述性文献较少.本文对近年来国内外相关文献进行了细致地调研分析,从算法模型、研究任务、实验数据等不同方面对NAS在脑数据分析领域的研究现状进行了综述.同时,本文也对能够支撑NAS训练的脑数据集进行了系统性总结,并对NAS在脑数据分析中存在的挑战和未来的研究方向进行了分析和展望.",
        "pdf_url": "jos/article/pdf/7012?st=article_issue",
        "html_url": "jos/article/html/7012?st=article_issue"
    },
    {
        "title": "一种分组并行的轻量化实时微观三维形貌重建方法",
        "authors": [
            "闫涛，高浩轩，张江峰，钱宇华，张临垣"
        ],
        "summary": "微观三维形貌重建作为精密制造领域生产制造的关键环节,其重建过程依赖于高分辨率稠密图像的采集.而面对复杂应用场景的高时效性需求,高分辨率稠密图像的输入会导致运算量与计算复杂度呈几何倍增加,无法实现高效率低延时的实时微观三维形貌重建.针对上述现状,本文提出一种分组并行的轻量级实时微观三维形貌重建方法GPLWS-Net,GPLWS-Net以U型网络为基础构造轻量化主干网络,以并行分组式查询加速三维形貌重建过程,并针对神经网络结构进行重参数化设计避免重建微观结构的精度损失.另外,为弥补现有微观三维重建数据集的缺失,本文公开了一组多聚焦微观三维重建数据集(Micro 3D),其标签数据利用多模态数据融合的方式获取场景高精度的三维结构.结果表明,本文提出的GPLWS-Net网络不仅可以保证重建精度,而且在三组公开数据集中相比于其他五类深度学习方法平均耗时降低39.15%,在Micro 3D数据集中平均耗时降低50.55%,能够实现复杂微观场景的实时三维形貌重建.",
        "pdf_url": "jos/article/pdf/7013?st=article_issue",
        "html_url": "jos/article/html/7013?st=article_issue"
    },
    {
        "title": "基于多样真实任务生成的鲁棒小样本分类方法",
        "authors": [
            "刘鑫，景丽萍，于剑"
        ],
        "summary": "随着大数据、计算机与互联网等技术的不断进步,以机器学习和深度学习为代表的人工智能技术取得了巨大成功,尤其是最近不断涌现的各种大模型,极大的加速了人工智能技术在各个领域的应用.但这些技术的成功离不开海量训练数据和充足的计算资源,大大限制了这些方法在一些数据或计算资源匮乏领域的应用.因此,如何利用少量样本进行学习,也就是小样本学习成为以人工智能技术引领新一轮产业变革中一个十分重要的研究问题.小样本学习中最常用的方法是基于元学习的方法.这类方法通过在一系列相似的训练任务上学习解决这类任务的元知识,在新的测试任务上利用元知识可以进行快速学习.虽然这类方法在小样本分类任务上取得了不错的效果,但是这类方法的一个潜在假设是训练任务和测试任务来自同一分布.这意味着训练任务需要足够多才能使模型学到的元知识泛化到不断变化的测试任务中.但是在一些真正数据匮乏的应用场景,训练任务的数量也是难以保证的.为此,本文提出一种基于多样真实任务生成的鲁棒小样本分类方法.该方法通过对已有少量任务进行Mixup,可以生成更多的训练任务帮助模型进行学习.通过约束生成任务的多样性和真实性,该方法可以有效提高小样本分类方法的泛化性.具体来说,我们先对训练集中的基类进行聚类得到不同的簇,然后从不同的簇中选取任务进行Mixup以增加生成任务的多样性.此外,簇间任务Mixup策略可以减轻学习到与类别高度相关的伪判别特征.同时,为了避免生成的任务与真实分布太偏离,误导模型学习,我们通过最小化生成任务与真实任务之间的最大均值差异(MMD)来保证生成任务的真实性.最后,我们从理论上分析了为什么基于簇间任务Mixup的策略可以提高模型的泛化性能.多个数据集上的实验结果进一步证明了本文提出的基于多样性和真实性任务扩充方法的有效性.",
        "pdf_url": "jos/article/pdf/7014?st=article_issue",
        "html_url": "jos/article/html/7014?st=article_issue"
    },
    {
        "title": "基于自适应权重的多源部分域适应",
        "authors": [
            "田青，孙灿宇，储奕"
        ],
        "summary": "作为机器学习的一个新兴领域，多源部分域适应问题由于其源域自身的复杂性、领域之间的差异性以及目标域自身的无监督性，给相关研究带来了挑战，以致目前鲜有相关工作被提出．在该场景下，多个源域中的无关类样本在域适应过程中会造成较大的累积误差和负迁移．此外，现有多源域适应方法大多未考虑不同源域对目标域任务的贡献度不同．因此，本文提出基于自适应权重的多源部分域适应方法(AW-MSPDA)．首先，我们构建了多样性特征提取器以有效利用源域的先验知识．同时我们设计了多层次分布对齐策略从不同层面消除了分布差异，促进了正迁移．此外，为量化不同源域贡献度以及过滤源域无关类样本，我们利用相似性度量以及伪标签加权方式构建自适应权重．最后，通过大量实验验证了所提出AW-MSPDA算法的泛化性以及优越性．",
        "pdf_url": "jos/article/pdf/7015?st=article_issue",
        "html_url": "jos/article/html/7015?st=article_issue"
    },
    {
        "title": "基于多模态对比学习的代码表征增强预训练方法",
        "authors": [
            "杨宏宇，马建辉，侯旻，沈双宏，陈恩红"
        ],
        "summary": "代码表征旨在融合源代码的特征,以获取其语义向量,在基于深度学习的代码智能中扮演着重要角色.传统基于手工的代码表征依赖领域专家的标注,繁重耗时,且无法灵活地复用于特定下游任务,这与绿色低碳的发展理念极不相符.因此,近年来,许多自监督学习的编程语言大规模预训练模型(如CodeBERT)应运而生,为获取通用代码表征提供了有效途径.这些模型通过预训练获得通用的代码表征,然后在具体任务上进行微调,取得了显著成果.但是,要准确表示代码的语义信息,需要融合所有抽象层次的特征(文本级、语义级、功能级和结构级).然而,现有模型将编程语言仅视为类似于自然语言的普通文本序列,忽略了它的功能级和结构级特征.因此,旨在进一步提高代码表征的准确性,本文提出一个基于多模态对比学习的代码表征增强的预训练模型(Representation Enhanced COntrastive Multimodal Pretrain-ing,REcomp).REcomp设计了新的语义级-结构级特征融合算法,将它用于序列化抽象语法树,并通过多模态对比学习的方法将该复合特征与编程语言的文本级和功能级特征相融合,以实现更精准的语义建模.最后,本文在3个真实的公开数据集上进行了实验,验证了REcomp在提高代码表征准确性方面的有效性.",
        "pdf_url": "jos/article/pdf/7016?st=article_issue",
        "html_url": "jos/article/html/7016?st=article_issue"
    },
    {
        "title": "基于动态批量评估的绿色无梯度优化方法研究",
        "authors": [
            "钱鸿，舒翔，孙天祥，邱锡鹏，周爱民"
        ],
        "summary": "在基于语言模型即服务的提示词黑盒微调、机器学习模型超参数调节等优化任务中,由于解空间到性能指标之间的映射关系复杂多变,难以显式地构建目标函数,故常采用无梯度优化方法来实现寻优.解的准确、稳定评估是有效实施无梯度优化方法的关键,完成一次解的质量评估常要求在整个数据集上完整运行一次模型,且优化过程有时需要大量评估解的质量,随着机器学习模型复杂度以及训练样本量的不断增加,准确、稳定的解的质量评估时间成本与计算代价越来越高昂,这与绿色低碳机器学习与优化理念背道而驰.有鉴于此,本文提出了一种基于动态批量评估的绿色无梯度优化方法框架(Green Derivative-free Optimization with Dynamic Batch Evaluation,GRACE),基于训练子集的相似性,在优化过程中自适应动态调节评估解时使用的样本量,使得GRACE在保证优化性能的同时,降低优化成本与代价,达到绿色低碳高效的目标.本文在语言模型即服务提示词黑盒微调、模型超参数优化等实际任务上进行了实验验证,通过与一系列对比方法以及GRACE消融退化版算法进行比较分析,表明了GRACE的有效性、高效性、绿色低碳性.超参数分析结果表明了其具备超参数稳健性.",
        "pdf_url": "jos/article/pdf/7017?st=article_issue",
        "html_url": "jos/article/html/7017?st=article_issue"
    },
    {
        "title": "多视角融合的时空动态图卷积网络城市交通流量预测",
        "authors": [
            "赵文竹，袁冠，张艳梅，乔少杰，王森章，张雷"
        ],
        "summary": "城市交通流量预测是构建绿色低碳、安全高效的智能交通系统的重要组成部分.时空图神经网络由于具有强大的时空数据表征能力,被广泛应用于城市交通流量预测.当前时空图神经网络在城市交通流量预测中仍存在以下两方面局限性:1)直接构建静态路网拓扑图对城市空间相关性进行表示,忽略了节点的动态交通模式,难以表达节点流量之间的时序相似性,无法捕获路网节点之间在时序上的动态关联.2)只考虑路网节点的局部空间相关性,忽略节点的全局空间相关性,无法建模交通路网中局部区域和全局空间之间的依赖关系.为打破上述局限性,本文提出了一种多视角融合的时空动态图卷积模型用于预测交通流量.首先,从静态空间拓扑和动态流量模式视角出发,构建路网空间结构图和动态流量关联图,并使用动态图卷积学习节点在两种视角下的特征,全面捕获城市路网中多元的空间相关性.其次,从局部视角和全局视角出发,计算路网的全局表示,将全局特征与局部特征融合,增强路网节点特征的表现力,发掘城市交通流量的整体结构特征.接下来,设计了局部卷积多头自注意力机制来获取交通数据的动态时间相关性,实现在多种时间窗口下的准确流量预测.最后,在四种真实交通数据上的实验结果证明了本文模型的有效性和准确性.",
        "pdf_url": "jos/article/pdf/7018?st=article_issue",
        "html_url": "jos/article/html/7018?st=article_issue"
    },
    {
        "title": "基于强化联邦图神经网络的个性化公共安全突发事件检测方法",
        "authors": [
            "管泽礼，杜军平，薛哲，王沛文，潘圳辉，王晓阳"
        ],
        "summary": "近年来,将公共安全数据转换为图的形式,通过图神经网络构造节点表示应用于下游任务的方法,充分利用了公共安全数据的实体与关联信息,取得了较好的效果.为了提高模型的有效性,需要大量的高质量数据,但是高质量的数据通常归属于政府、公司和组织,很难通过数据集中的方式使模型学习到有效的事件检测模型.由于各数据拥有方的关注主题与收集时间不同,数据之间存在Non-IID的问题.传统的假设一个全局模型可以适合所有客户端的方法难以解决此类问题.本文提出了基于强化联邦图神经网络的公共安全突发事件检测方法PPSED,各客户端采用多方协作的方式训练个性化的模型来解决本地的突发事件检测任务.设计联邦公共安全突发事件检测模型的本地训练与梯度量化模块,采用基于图采样的minibatch机制的GraphSage构造公共安全突发事件检测本地模型,以减小数据Non-IID的影响,采用梯度量化方法减小梯度通信的消耗.设计基于随机图嵌入的客户端状态感知模块,在保护隐私的同时更好地保留客户端模型有价值的梯度信息.设计强化联邦图神经网络的个性化梯度聚合与量化策略,采用DDPG拟合个性化联邦学习梯度聚合加权策略,并根据权重决定是否对梯度进行量化,对模型的性能与通信压力进行平衡.通过在微博平台收集的公共安全数据集和三个公开的图数据集进行了大量的实验,实验结果表明了提出的方法的有效性.",
        "pdf_url": "jos/article/pdf/7019?st=article_issue",
        "html_url": "jos/article/html/7019?st=article_issue"
    }
]