[
    {
        "title": "量子计算系统软件研究综述",
        "authors": [
            "谢磊，翟季冬"
        ],
        "summary": "量子计算理论上有望解决诸多经典难解问题, 近年来量子计算机的快速发展正推动这一理论进入实践. 然而, 当前硬件中繁多的错误会造成计算结果出错, 严重限制了量子计算机解决实际问题的能力. 量子计算系统软件位于应用与硬件之间, 充分挖掘系统软件在硬件错误减缓方面的潜力, 对于近期实现有实用价值的量子计算而言至关重要. 由此, 近期涌现了一批量子计算系统软件研究工作. 将这些工作归纳入编译器、运行时系统和调试器3个范畴, 通过对它们的分析总结, 梳理量子计算系统软件的研究现状, 揭示其在硬件错误减缓方面的重要作用. 并对未来的研究方向进行展望.",
        "pdf_url": "jos/article/pdf/6908?st=article_issue",
        "html_url": "jos/article/html/6908?st=article_issue"
    },
    {
        "title": "开源软件漏洞感知技术综述",
        "authors": [
            "詹奇，潘圣益，胡星，鲍凌峰，夏鑫"
        ],
        "summary": "随着现代软件规模不断扩大, 软件漏洞给计算机系统和软件的安全运行、可靠性造成了极大的威胁, 进而给人们的生产生活造成巨大的损失. 近年来, 随着开源软件的广泛使用, 其安全问题受到广泛关注. 漏洞感知技术可以有效地帮助开源软件用户在漏洞纰漏之前提前感知到漏洞的存在, 从而进行有效防御. 与传统软件的漏洞检测不同, 开源漏洞的透明性和协同性给开源软件的漏洞感知带来巨大的挑战. 因此, 有许多学者和从业人员提出多种技术, 从代码和开源社区中感知开源软件中潜在的漏洞和风险, 以尽早发现开源软件中的漏洞从而降低漏洞所带来的损失. 为了促进开源软件漏洞感知技术的发展, 对已有研究成果进行系统的梳理、总结和点评. 选取45篇开源漏洞感知技术的高水平论文, 将其分为3大类: 基于代码的漏洞感知技术、基于开源社区讨论的漏洞感知技术和基于软件补丁的漏洞感知技术, 并对其进行系统地梳理、归纳和总结. 值得注意的是, 根据近几年最新研究的总结, 首次提出基于开源软件漏洞生命周期的感知技术分类, 对已有的漏洞感知技术分类进行补充和完善. 最后, 探索该领域的挑战, 并对未来研究的方向进行展望.",
        "pdf_url": "jos/article/pdf/6935?st=article_issue",
        "html_url": "jos/article/html/6935?st=article_issue"
    },
    {
        "title": "智能合约漏洞检测技术综述",
        "authors": [
            "董伟良，刘哲，刘逵，黎立，葛春鹏，黄志球"
        ],
        "summary": "智能合约作为可信的去中心化应用, 获得了广泛的关注, 但其安全漏洞问题对其可靠性带来了巨大威胁. 为此, 研究者们利用各种前沿技术(如模糊测试、机器学习、形式化验证等)研究了多种漏洞检测技术, 并取得了可观的效果. 为了系统性地梳理与分析现有智能合约漏洞检测技术, 搜集截至2021年7月关于智能合约漏洞检测的84篇论文, 根据它们的核心方法进行分类, 从每种技术的实现方法、漏洞类型、实验数据等方面展开分析, 同时对比国内外研究现状在这些方面的差异. 最后, 对现有的智能合约漏洞检测技术进行总结, 探讨面临的挑战, 并展望了未来的研究方向.",
        "pdf_url": "jos/article/pdf/6810?st=article_issue",
        "html_url": "jos/article/html/6810?st=article_issue"
    },
    {
        "title": "软件运行时配置研究综述",
        "authors": [
            "周书林，李姗姗，董威，王戟，廖湘科"
        ],
        "summary": "运行时配置为用户使用软件提供了灵活性和可定制性, 但其巨大的规模和复杂的机制也带来了巨大的挑战. 大量学者和研究机构针对软件运行时配置展开了研究, 以提升软件系统在复杂外部环境中的可用性和适应性. 建立运行时配置研究分析框架, 从配置分析与理解、配置缺陷检测与故障诊断、配置应用3个阶段对现有研究工作进行归类和分析, 总结归纳现有研究的不足和面临的挑战, 并对未来的研究趋势进行展望, 对下一步研究具有一定的指导意义.",
        "pdf_url": "jos/article/pdf/6835?st=article_issue",
        "html_url": "jos/article/html/6835?st=article_issue"
    },
    {
        "title": "面向链接预测的知识图谱表示学习方法综述",
        "authors": [
            "杜雪盈，刘名威，沈立炜，彭鑫"
        ],
        "summary": "作为人工智能的重要基石, 知识图谱能够从互联网海量数据中抽取并表达先验知识, 极大程度解决了智能系统认知决策可解释性差的瓶颈问题, 对智能系统的构建与应用起关键作用. 随着知识图谱技术应用的不断深化, 旨在解决图谱欠完整性问题的知识图谱补全工作迫在眉睫. 链接预测是针对知识图谱中缺失的实体与关系进行预测的任务, 是知识图谱构建与补全中不可或缺的一环. 要充分挖掘知识图谱中的隐藏关系, 利用海量的实体与关系进行计算, 就需要将符号化表示的信息转换为数值形式, 即进行知识图谱表示学习. 基于此, 面向链接预测的知识图谱表示学习成为知识图谱领域的研究热点. 从链接预测与表示学习的基本概念出发, 系统性地介绍面向链接预测的知识图谱表示学习方法最新研究进展. 具体从知识表示形式、算法建模方式两种维度对研究进展进行详细论述. 以知识表示形式的发展历程为线索, 分别介绍二元关系、多元关系和超关系知识表示形式下链接预测任务的数学建模. 基于表示学习建模方式, 将现有方法细化为4类模型: 平移距离模型、张量分解模型、传统神经网络模型和图神经网络模型, 并详细描述每类模型的实现方式与解决不同关系元数链接预测任务的代表模型. 在介绍链接预测的常用的数据集与评判标准基础上, 分别对比分析二元关系、多元关系和超关系3类知识表示形式下, 4类知识表示学习模型的链接预测效果, 并从模型优化、知识表示形式和问题作用域3个方面展望未来发展趋势.",
        "pdf_url": "jos/article/pdf/6902?st=article_issue",
        "html_url": "jos/article/html/6902?st=article_issue"
    },
    {
        "title": "微服务系统服务依赖发现技术综述",
        "authors": [
            "张齐勋，吴一凡，杨勇，贾统，李影，吴中海"
        ],
        "summary": "微服务架构得到了广泛的部署与应用, 提升了软件系统开发的效率, 降低了系统更新与维护的成本, 提高了系统的可扩展性. 但微服务变更频繁、异构融合等特点使得微服务故障频发、其故障传播快且影响大, 同时微服务间复杂的调用依赖关系或逻辑依赖关系又使得其故障难以被及时、准确地定位与诊断, 对微服务架构系统的智能运维提出了挑战. 服务依赖发现技术从系统运行时数据中识别并推断服务之间的调用依赖关系或逻辑依赖关系, 构建服务依赖关系图, 有助于在系统运行时及时、精准地发现与定位故障并诊断根因, 也有利于如资源调度、变更管理等智能运维需求. 首先就微服务系统中服务依赖发现问题进行分析, 其次, 从基于监控数据、系统日志数据、追踪数据等3类运行时数据的角度总结分析了服务依赖发现技术的技术现状; 然后, 以基于服务依赖关系图的故障根因定位、资源调度与变更管理等为例, 讨论了服务依赖发现技术应用于智能运维的相关研究. 最后, 对服务依赖发现技术如何准确地发现调用依赖关系和逻辑依赖关系, 如何利用服务依赖关系图进行变更治理进行了探讨并对未来的研究方向进行了展望.",
        "pdf_url": "jos/article/pdf/6827?st=article_issue",
        "html_url": "jos/article/html/6827?st=article_issue"
    },
    {
        "title": "漏洞自动修复研究综述",
        "authors": [
            "徐同同，刘逵，夏鑫"
        ],
        "summary": "软件漏洞是计算机软件系统安全方面的缺陷, 给现代软件及其应用数据的完整性、安全性和可靠性带来巨大威胁. 人工治理漏洞费时且易错, 为了更好应对漏洞治理挑战, 研究者提出多种自动化漏洞治理方案, 其中漏洞自动修复方法近来得到研究者广泛关注. 漏洞自动修复技术旨在辅助开发人员修复漏洞, 涵盖漏洞根因定位、补丁生成、补丁验证等功能. 现有工作缺乏对漏洞修复技术系统性的分类与讨论, 为了促进漏洞修复技术发展, 加深研究人员对漏洞修复问题的认知理解, 对现有漏洞修复方法技术的理论、实践、适用场景和优缺点进行全面洞察, 并撰写了漏洞自动修复技术的研究综述. 主要内容包括: (1)按照修复漏洞类型不同整理归纳特定类型漏洞的修复方法以及通用类型漏洞的修复方法; (2)按照所采用的技术原理将不同修复方法进行分类与总结; (3)归纳漏洞修复主要挑战; (4)展望漏洞修复未来发展方向.",
        "pdf_url": "jos/article/pdf/6828?st=article_issue",
        "html_url": "jos/article/html/6828?st=article_issue"
    },
    {
        "title": "卷积神经网络的可解释性研究综述",
        "authors": [
            "窦慧，张凌茗，韩峰，申富饶，赵健"
        ],
        "summary": "神经网络模型性能日益强大, 被广泛应用于解决各类计算机相关任务, 并表现出非常优秀的能力, 但人类对神经网络模型的运行机制却并不完全理解. 针对神经网络可解释性的研究进行了梳理和汇总, 就模型可解释性研究的定义、必要性、分类、评估等方面进行了详细的讨论. 从解释算法的关注点出发, 提出一种神经网络可解释算法的新型分类方法, 为理解神经网络提供一个全新的视角. 根据提出的新型分类方法对当前卷积神经网络的可解释方法进行梳理, 并对不同类别解释算法的特点进行分析和比较. 同时, 介绍了常见可解释算法的评估原则和评估方法. 对可解释神经网络的研究方向与应用进行概述. 就可解释神经网络面临的挑战进行阐述, 并针对这些挑战给出可能的解决方向.",
        "pdf_url": "jos/article/pdf/6758?st=article_issue",
        "html_url": "jos/article/html/6758?st=article_issue"
    },
    {
        "title": "图像对抗样本检测综述",
        "authors": [
            "周涛，甘燃，徐东伟，王竟亦，宣琦"
        ],
        "summary": "深度神经网络是人工智能领域的一项重要技术, 它被广泛应用于各种图像分类任务. 但是, 现有的研究表明深度神经网络存在安全漏洞, 容易受到对抗样本的攻击, 而目前并没有研究针对图像对抗样本检测进行体系化分析. 为了提高深度神经网络的安全性, 针对现有的研究工作, 全面地介绍图像分类领域的对抗样本检测方法. 首先根据检测器的构建方式将检测方法分为有监督检测与无监督检测, 然后根据其检测原理进行子类划分. 最后总结对抗样本检测领域存在的问题, 在泛化性和轻量化等方面提出建议与展望, 旨在为人工智能安全研究提供帮助.",
        "pdf_url": "jos/article/pdf/6834?st=article_issue",
        "html_url": "jos/article/html/6834?st=article_issue"
    },
    {
        "title": "基于学习-推理的约束求解方法研究进展",
        "authors": [
            "邹悦，赖家洋，张永刚"
        ],
        "summary": "机器学习与自动推理的融合是当前人工智能研究的新趋势. 约束满足问题是人工智能研究的经典问题, 现实世界中大量的调度、规划和配置等问题均可以建模为约束满足问题, 高效的求解算法一直是研究热点. 近年来涌现出众多将机器学习应用于约束满足问题求解的新方法, 这些基于“学习-推理”的新方法为约束满足问题求解开辟了新方向并展示出巨大发展潜力, 方法的突出优点是适应性强、可在线优化并具有更强的可扩展性. 将当前的“学习-推理”方法分为基于消息传递神经网络、基于序列到序列和基于最优化等3类进行综述, 详细分析各类方法的特点和在不同的问题集上求解效果, 尤其对每类方法所涵盖的相关工作进行多角度的对比分析. 最后, 对基于“学习-推理”的约束求解方法进行总结和展望.",
        "pdf_url": "jos/article/pdf/6844?st=article_issue",
        "html_url": "jos/article/html/6844?st=article_issue"
    },
    {
        "title": "常识问答研究综述",
        "authors": [
            "范怡帆，邹博伟，徐庆婷，李志峰，洪宇"
        ],
        "summary": "常识问答是一项重要的自然语言理解任务, 旨在利用常识知识对自然语言问句进行自动求解, 以得到准确答案. 常识问答在虚拟助手或社交聊天机器人等领域有着广泛的应用前景, 且其蕴涵了知识挖掘与表示、语言理解与计算、答案推理和生成等关键科学问题, 因而受到工业界和学术界的广泛关注. 首先介绍常识问答领域的主要数据集; 其次, 归纳不同常识知识源在构建方式、常识来源和表现形式上的区别; 同时, 重点分析并对比前沿常识问答模型, 以及融合常识知识的特色方法. 特别地, 根据不同问答任务场景中常识知识的共性和特性, 建立包含属性、语义、因果、语境、抽象和意图6大类的知识分类体系. 以此为支撑, 针对常识知识数据集建设, 感知知识融合和预训练语言模型的协作机制, 以及在此基础上的常识知识预分类技术, 进行前瞻性的研究, 并具体报告上述模型在跨数据集迁移场景下的性能变化, 及其在常识答案推理中的潜在贡献. 总体上, 包含对现有数据和前沿技术的回顾, 也包含面向跨数据知识体系建设、技术迁移与通用化的预研内容, 借以在汇报领域技术积累的前提下, 为其理论和技术的进一步发展提供参考意见.",
        "pdf_url": "jos/article/pdf/6913?st=article_issue",
        "html_url": "jos/article/html/6913?st=article_issue"
    },
    {
        "title": "天地一体化网络关键技术研究综述",
        "authors": [
            "蒋长林，李清，王羽，赵丹，赵达毅，江勇，徐明伟"
        ],
        "summary": "作为地面网络的补充和延伸, 卫星网络有助于加速弥合区域间的数字鸿沟, 扩展地面网络的覆盖和服务范围. 然而卫星网络拓扑动态性高、传播时延大、星上计算能力和存储能力均受限, 因此实现卫星网络与地面网络的有机融合, 构建覆盖全球的天地一体化网络面临路由扩展性、传输稳定性等技术挑战. 针对天地一体化网络的研究挑战, 从网络架构、路由、传输和基于组播的内容分发等方面介绍了国内外的研究现状, 并展望了天地一体化网络的发展趋势.",
        "pdf_url": "jos/article/pdf/6753?st=article_issue",
        "html_url": "jos/article/html/6753?st=article_issue"
    },
    {
        "title": "物联网设备识别及异常检测研究综述",
        "authors": [
            "樊琳娜，李城龙，吴毅超，段晨鑫，王之梁，林海，杨家海"
        ],
        "summary": "随着物联网技术的发展, 物联网设备广泛应用于生产和生活的各个领域, 但也为设备资产管理和安全管理带来了严峻的挑战. 首先, 由于物联网设备类型和接入方式的多样性, 网络管理员通常难以得知网络中的物联网设备类型及运行状态. 其次, 物联网设备由于其计算、存储资源有限, 难以部署传统防御措施, 正逐渐成为网络攻击的焦点. 因此, 通过设备识别了解网络中的物联网设备并基于设备识别结果进行异常检测, 以保证其正常运行尤为重要. 近几年来, 学术界围绕上述问题开展了大量的研究. 系统地梳理物联网设备识别和异常检测方面的相关工作. 在设备识别方面, 根据是否向网络中发送数据包, 现有研究可分为被动识别方法和主动识别方法. 针对被动识别方法按照识别方法、识别粒度和应用场景进行进一步的调研, 针对主动识别方法按照识别方法、识别粒度和探测粒度进行进一步的调研. 在异常检测方面, 按照基于机器学习算法的检测方法和基于行为规范的规则匹配方法进行梳理. 在此基础上, 总结物联网设备识别和异常检测领域的研究挑战并展望其未来发展方向.",
        "pdf_url": "jos/article/pdf/6818?st=article_issue",
        "html_url": "jos/article/html/6818?st=article_issue"
    },
    {
        "title": "DNS信道传输加密技术: 现状、趋势和挑战",
        "authors": [
            "张曼，姚健康，李洪涛，董科军，延志伟"
        ],
        "summary": "DNS作为重要的互联网基础设施, 其明文传输的特点带来很多隐私安全风险. DoH、DoT、DoQ等DNS信道传输加密技术致力于防止DNS数据被泄露或篡改, 并保证DNS消息来源的可靠性. 首先从DNS消息格式、数据存储和管理、系统架构和部署等6个方面分析明文DNS存在的隐私安全问题, 并对已有的相关技术和协议进行总结. 其次分析DNS信道传输加密技术的实现原理及应用现状, 进而基于多角度评测指标对各加密协议在不同网络条件下的性能表现进行讨论. 同时通过填充机制的局限性、加密流量识别和基于指纹的加密活动分析等方向探讨DNS信道传输加密技术的隐私保护效果. 此外从部署规范、恶意流量对加密技术的利用和攻击、隐私和网络安全管理之间的矛盾, 以及加密后影响隐私安全的其他因素等方面总结DNS信道传输加密技术存在的问题、挑战和相关解决方案. 最后总结加密DNS服务的发现、递归解析器到权威服务器之间的加密、服务器端的隐私保护、基于HTTP/3的DNS等后续需要着重关注的研究方向.",
        "pdf_url": "jos/article/pdf/6898?st=article_issue",
        "html_url": "jos/article/html/6898?st=article_issue"
    },
    {
        "title": "加密恶意流量检测及对抗综述",
        "authors": [
            "侯剑，鲁辉，刘方爱，王兴伟，田志宏"
        ],
        "summary": "网络流量加密在保护企业数据和用户隐私的同时, 也为恶意流量检测带来新的挑战. 根据处理加密流量的方式不同, 加密恶意流量检测可分为主动检测和被动检测. 主动检测包括对流量解密后的检测和基于可搜索加密技术的检测, 其研究重点是隐私安全的保障和检测效率的提升, 主要分析可信执行环境和可控传输协议等保障措施的应用. 被动检测是在用户无感知且不执行任何加密或解密操作的前提下, 识别加密恶意流量的检测方法, 其研究重点是特征的选择与构建, 主要从侧信道特征、明文特征和原始流量等3类特征分析相关检测方法, 给出有关模型的实验评估结论. 最后, 从混淆流量特征、干扰学习算法和隐藏相关信息等角度, 分析加密恶意流量检测对抗研究的可实施性.",
        "pdf_url": "jos/article/pdf/6891?st=article_issue",
        "html_url": "jos/article/html/6891?st=article_issue"
    },
    {
        "title": "智能数据可视分析技术综述",
        "authors": [
            "骆昱宇，秦雪迪，谢宇鹏，李国良"
        ],
        "summary": "如何从海量数据中快速有效地挖掘出有价值的信息以更好地指导决策, 是大数据分析的重要目标. 可视分析是一种重要的大数据分析方法, 它利用人类视觉感知特性, 使用可视化图表直观呈现复杂数据中蕴含的规律, 并支持以人为本的交互式数据分析. 然而, 可视分析仍然面临着许多挑战, 例如数据准备代价高、交互响应高延迟、可视分析高门槛和交互模式效率低. 为应对这些挑战, 研究者从数据管理、人工智能等视角出发, 提出一系列方法以优化可视分析系统的人机协作模式和提高系统的智能化程度. 系统性地梳理、分析和总结这些方法, 提出智能数据可视分析的基本概念和关键技术框架. 然后, 在该框架下, 综述和分析国内外面向可视分析的数据准备、智能数据可视化、高效可视分析和智能可视分析接口的研究进展. 最后, 展望智能数据可视分析的未来发展趋势.",
        "pdf_url": "jos/article/pdf/6911?st=article_issue",
        "html_url": "jos/article/html/6911?st=article_issue"
    },
    {
        "title": "支持混合事务和分析处理的数据库管理系统综述",
        "authors": [
            "王嵩立，荆一楠，何震瀛，张凯，王晓阳"
        ],
        "summary": "数据库管理系统根据应用场景分为事务型(OLTP)系统和分析型(OLAP)系统. 随着实时数据分析需求增长, OLTP任务和OLAP任务混合的场景越来越普遍, 业界开始重视支持混合事务和分析处理(HTAP)的数据库管理系统. 这种HTAP数据库系统除了需要满足高性能的事务处理外, 还需要满足实时分析对数据新鲜度的要求. 因此, 对数据库系统的设计与实现提出了新的挑战. 近年来, 在工业界和学术界涌现了一批架构多样、技术各异的原型和产品. 综述HTAP数据库的背景和发展现状, 并且从存储和计算的角度对现阶段的HTAP数据库进行分类. 在此基础上, 按照从下往上的顺序分别总结HTAP系统在存储和计算方面采用的关键技术. 在此框架下介绍各类系统的设计思想、优劣势以及适用的场景. 此外, 结合HTAP数据库的评测基准和指标, 分析各类HTAP数据库的设计与其呈现出的性能与数据新鲜度的关联. 最后, 结合云计算、人工智能和新硬件技术为HTAP数据库的未来研究和发展提供思路.",
        "pdf_url": "jos/article/pdf/6916?st=article_issue",
        "html_url": "jos/article/html/6916?st=article_issue"
    },
    {
        "title": "支持实时流计算应用的关键技术研究进展",
        "authors": [
            "徐志榛，徐辰，丁光耀，陈梓浩，周傲英"
        ],
        "summary": "信息系统在进行知识的挖掘和管理时, 需要处理各种形式的数据, 流数据便是其中之一. 流数据具有数据规模大、产生速度快且蕴含的知识具有较强时效性等特点, 因而发展支持实时处理应用的流计算技术对于信息系统的知识管理十分重要. 流计算系统可以追溯到29世纪90年代, 至今已经经历了长足的发展. 然而, 当前多样化的知识管理需求和新一代的硬件架构为流计算系统带来了全新的挑战和机遇, 催生出了一系列流计算领域的技术研究. 首先介绍流计算系统的基本需求以及发展脉络, 再按照编程接口、执行计划、资源调度和故障容错4个层次分别分析流计算系统领域的相关技术; 最后, 展望流计算技术在未来可能的研究方向和发展趋势.",
        "pdf_url": "jos/article/pdf/6917?st=article_issue",
        "html_url": "jos/article/html/6917?st=article_issue"
    },
    {
        "title": "多副本分布式事务处理关键技术及典型数据库系统综述",
        "authors": [
            "黄纯悦，彭起，张拂晓，王声溢，罗成，张岩峰，于戈"
        ],
        "summary": "数据复制是分布式数据库提高可用性的重要手段, 通过在不同区域放置数据库的部分副本, 还可以提高本地读写操作的响应速度, 增加副本数量也会提升读负载的线性扩展能力. 考虑到这些优良特性, 近年来国内外都出现了众多多副本分布式数据库系统, 包括Google Spanner、CockroachDB、TiDB、OceanBase等一系列主流的工业界系统, 也出现了包括Calvin、Aria、Berkeley Anna等一系列优秀的学术界系统. 然而, 多副本数据库带来诸多收益的同时, 也带来了一致性维护、跨节点事务、事务隔离等一系列挑战. 总结分析现有的复制架构、一致性维护策略、跨节点事务并发控制等技术, 对比几个代表性多副本数据库系统之间在分布式事务处理方面上的差异与共同点, 并在阿里云环境下搭建跨区域的分布式集群环境, 对几个代表性系统的分布式事务处理能力进行了实验测试分析.",
        "pdf_url": "jos/article/pdf/6822?st=article_issue",
        "html_url": "jos/article/html/6822?st=article_issue"
    },
    {
        "title": "光滑粒子流体动力学流体仿真技术综述",
        "authors": [
            "刘树森，何小伟，王文成，吴恩华"
        ],
        "summary": "光滑粒子流体动力学(smoothed particle hydrodynamics, SPH)是实现流体仿真的主要技术之一. 随着生产实践中流体仿真应用需求的增加, 近些年涌现了许多相关研究成果, 改善了流体不可压缩性、粘性、表面张力等物理特性模拟的视觉真实性、效率与稳定性. 同时, 一些工作探讨了复杂场景的高质量模拟, 以及多场景、多材料的统一仿真框架, 增强了SPH流体仿真技术的应用效能. 从以上几个方面对SPH流体仿真技术进行归纳、总结和讨论, 并对其未来发展进行了展望.",
        "pdf_url": "jos/article/pdf/6777?st=article_issue",
        "html_url": "jos/article/html/6777?st=article_issue"
    }
]